# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

print('введите первое число: ')
a = int(input())
print('введите второе число: ')
b = int(input())
print('введите третье число: ')
c = int(input())

print(a, '+', b, '+', c, '=', a + b + c) 